backend/app/controllers/api/posts_controller.rb

    def create
      post = GroupbuyPost.new(post_params)

      if params[:images].present?
        params[:images].each_with_index do |img, idx|
          post.post_images.build(
            filename: img.original_filename,
            content_type: img.content_type,
            image_data: img.read,
            position: idx + 1
          )
        end
      end

      if post.save
---
INSERT INTO "groupbuy_posts" ("product_name", "original_description", "source_language", "translated_description", "generated_post", "edited_post", "group_price", "start_date", "end_date", "order_method", "shipping_json", "status", "created_at", "updated_at") VALUES ('未命名', '200 Watt Portable Solar Panel, Renogy Solar Blanket N-Type Foldable Solar Panel